boyisgood86/rt_thread_v1.2.2_enc28j60/rt-thread-1.2.2/bsp/stm32f10x/drivers/w25x80.c
                if(recv_ptr != RT_NULL)
                {
                    *recv_ptr++ = data;
                }
            }
        }
    }

    /* release CS */
    if(message->cs_release)
    {
        GPIO_SetBits(stm32_spi_cs->GPIOx, stm32_spi_cs->GPIO_Pin);
    }

    return message->length;
};


 static struct rt_spi_ops stm32_spi_ops =
 {
     configure,
     xfer
 };

 
 /** \brief init and register stm32 spi bus.
 *
 * \param SPI: STM32 SPI, e.g: SPI1,SPI2,SPI3.
 * \param stm32_spi: stm32 spi bus struct.
 * \param spi_bus_name: spi bus name, e.g: "spi1"
 * \return
 *
 */
rt_err_t stm32_spi_register(SPI_TypeDef * SPI,
                            struct stm32_spi_bus * stm32_spi,
                            const char * spi_bus_name)
{
    if(SPI == SPI1)
    {
    	stm32_spi->SPI = SPI1;
#ifdef SPI_USE_DMA
//        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
//        /* DMA2_Stream0 DMA_Channel_3 : SPI1_RX */
//        /* DMA2_Stream2 DMA_Channel_3 : SPI1_RX */
//        stm32_spi->DMA_Stream_RX = DMA2_Stream0;
//        stm32_spi->DMA_Channel_RX = DMA_Channel_3;
//        stm32_spi->DMA_Channel_RX_FLAG_TC = DMA_FLAG_TCIF0;
//        /* DMA2_Stream3 DMA_Channel_3 : SPI1_TX */
//        /* DMA2_Stream5 DMA_Channel_3 : SPI1_TX */
//        stm32_spi->DMA_Stream_TX = DMA2_Stream3;
//        stm32_spi->DMA_Channel_TX = DMA_Channel_3;
//        stm32_spi->DMA_Channel_TX_FLAG_TC = DMA_FLAG_TCIF3;
#endif
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
    }
    else if(SPI == SPI2)
    {
        stm32_spi->SPI = SPI2;
#ifdef SPI_USE_DMA
//        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);
//        /* DMA1_Stream3 DMA_Channel_0 : SPI2_RX */
//        stm32_spi->DMA_Stream_RX = DMA1_Stream3;
//        stm32_spi->DMA_Channel_RX = DMA_Channel_0;
//        stm32_spi->DMA_Channel_RX_FLAG_TC = DMA_FLAG_TCIF3;
//        /* DMA1_Stream4 DMA_Channel_0 : SPI2_TX */
//        stm32_spi->DMA_Stream_TX = DMA1_Stream4;
//        stm32_spi->DMA_Channel_TX = DMA_Channel_0;
//        stm32_spi->DMA_Channel_TX_FLAG_TC = DMA_FLAG_TCIF4;
#endif
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
    }
    else if(SPI == SPI3)
    {
    	stm32_spi->SPI = SPI3;
#ifdef SPI_USE_DMA
//        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);
//        /* DMA1_Stream2 DMA_Channel_0 : SPI3_RX */
//        stm32_spi->DMA_Stream_RX = DMA1_Stream2;
//        stm32_spi->DMA_Channel_RX = DMA_Channel_0;
//        stm32_spi->DMA_Channel_RX_FLAG_TC = DMA_FLAG_TCIF2;
//        /* DMA1_Stream5 DMA_Channel_0 : SPI3_TX */
//        stm32_spi->DMA_Stream_TX = DMA1_Stream5;
//        stm32_spi->DMA_Channel_TX = DMA_Channel_0;
//        stm32_spi->DMA_Channel_TX_FLAG_TC = DMA_FLAG_TCIF5;
#endif
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);
    }
    else
    {
        return RT_ENOSYS;
    }

    return rt_spi_bus_register(&stm32_spi->parent, spi_bus_name, &stm32_spi_ops);
}
 
 

 void rt_hw_spi2_init(void)
{
    /* register spi bus */
  {
    static struct stm32_spi_bus stm32_spi;
    GPIO_InitTypeDef GPIO_InitStructure;
    
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
    
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    
#ifdef SPI_USE_DMA
//        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);
//        /* DMA1_Stream3 DMA_Channel_0 : SPI2_RX */
//        stm32_spi->DMA_Stream_RX = DMA1_Stream3;
//        stm32_spi->DMA_Channel_RX = DMA_Channel_0;
//        stm32_spi->DMA_Channel_RX_FLAG_TC = DMA_FLAG_TCIF3;
//        /* DMA1_Stream4 DMA_Channel_0 : SPI2_TX */
//        stm32_spi->DMA_Stream_TX = DMA1_Stream4;
//        stm32_spi->DMA_Channel_TX = DMA_Channel_0;
//        stm32_spi->DMA_Channel_TX_FLAG_TC = DMA_FLAG_TCIF4;
#endif /*SPI_USE_DMA*/
        stm32_spi_register(SPI2, &stm32_spi, "spi2");
        MY_DEBUG("%s, %d: retister over !\n\r",__func__,__LINE__);
  }
  
    /* attach cs */
    {
        static struct rt_spi_device spi_device;
        static struct stm32_spi_cs  spi_cs;

        GPIO_InitTypeDef GPIO_InitStructure;

        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;

        /* spi21: PB12 */
        spi_cs.GPIOx = GPIOB;
        spi_cs.GPIO_Pin = GPIO_Pin_12;
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

        GPIO_InitStructure.GPIO_Pin = spi_cs.GPIO_Pin;
        GPIO_SetBits(spi_cs.GPIOx, spi_cs.GPIO_Pin);
        GPIO_Init(spi_cs.GPIOx, &GPIO_InitStructure);

        MY_DEBUG("%s, %d: attach device !\n\r",__func__,__LINE__);
        rt_spi_bus_attach_device(&spi_device, "spi20", "spi2", (void*)&spi_cs);
    }  
    
}


/*********************************** W25X80 driver ***************************************/





#define FLASH_DEBUG

#ifdef FLASH_DEBUG
#define FLASH_TRACE         rt_kprintf
#else
#define FLASH_TRACE(...)
#endif /* #ifdef FLASH_DEBUG */

/* w25qx flash
        1 PAGE  equal 256 byte
        1 SECTOR equal 16 page
*/

#define PAGE_SIZE           256
#define SECTOR_SIZE         4096

/* JEDEC Manufacturer¡¯s ID */
#define MF_ID           (0xEF)
/* JEDEC Device ID: Memory type and Capacity */
#define MTC_W25Q16_BV_CL_CV   (0x4015) /* W25Q16BV W25Q16CL W25Q16CV  */
#define MTC_W25Q16_DW         (0x6015) /* W25Q16DW  */
#define MTC_W25Q32_BV         (0x4016) /* W25Q32BV */
#define MTC_W25Q32_DW         (0x6016) /* W25Q32DW */
#define MTC_W25Q64_BV_CV      (0x4017) /* W25Q64BV W25Q64CV */
#define MTC_W25Q64_DW         (0x4017) /* W25Q64DW */
#define MTC_W25Q128_BV        (0x4018) /* W25Q128BV */
#define MTC_W25Q256_FV        (TBD)    /* W25Q256FV */

/* command list */
#define CMD_WRSR                    (0x01)  /* Write Status Register */
#define CMD_PP                      (0x02)  /* Page Program */
#define CMD_READ                    (0x03)  /* Read Data */
#define CMD_WRDI                    (0x04)  /* Write Disable */
#define CMD_RDSR1                   (0x05)  /* Read Status Register-1 */
#define CMD_WREN                    (0x06)  /* Write Enable */
#define CMD_FAST_READ               (0x0B)  /* Fast Read */
#define CMD_ERASE_4K                (0x20)  /* Sector Erase:4K */
#define CMD_RDSR2                   (0x35)  /* Read Status Register-2 */
#define CMD_ERASE_32K               (0x52)  /* 32KB Block Erase */
#define CMD_JEDEC_ID                (0x9F)  /* Read JEDEC ID */
#define CMD_ERASE_full              (0xC7)  /* Chip Erase */
#define CMD_ERASE_64K               (0xD8)  /* 64KB Block Erase */

