boyisgood86/rt_thread_v1.2.2_enc28j60/rt-thread-1.2.2/bsp/stm32f10x/drivers/w25x80.c
#define DUMMY                       (0xFF)

/* add W25X80 Memory type and Capacity */
#define MTC_W25X80_TY               (0x3014)  /* W25X80  */


/*************************************************************************/

/*W25X80 command list*/
#define CMD_WEn                  (0x06)      /* Write Enable */
#define CMD_WDs                  (0x04)      /* Write Disable */
#define CMD_RS                   (0x05)      /* Read Status Register */
#define CMD_WS                   (0x01)      /* Write Status Register */
#define CMD_RD                   (0x03)      /* Read Data */
#define CMD_FR                   (0x0B)      /* Fast Read */
#define CMD_FRDO                 (0x3B)      /* Fast Read Dual Output */
#define CMD_PPr                  (0x02)      /* Page Programming */
#define CMD_SE                   (0x20)      /* Sector Erase */
#define CMD_BE                   (0xD8)      /* Block Erase */
#define CMD_CE                   (0xC7)      /* Chip Erase */
#define CMD_Pd                   (0xB9)      /* Power down */
#define CMD_RP_ID                (0xAB)      /* Release Power down / Device ID */
#define CMD_RM_ID                (0x90)      /* Read Manufacturer / Device ID */
#define CMD_JEDEC_ID             (0x9F)      /* JEDEC ID */


/*************************************************************************/


static struct spi_flash_device  spi_flash_device;

static void flash_lock(struct spi_flash_device * flash_device)
{
    rt_mutex_take(&flash_device->lock, RT_WAITING_FOREVER);
}

static void flash_unlock(struct spi_flash_device * flash_device)
{
    rt_mutex_release(&flash_device->lock);
}

static uint8_t w25x80_read_status(void)
{
    return rt_spi_sendrecv8(spi_flash_device.rt_spi_device, CMD_RDSR1);
}

static void w25x80_wait_busy(void)
{
    while( w25x80_read_status() & (0x01));
}

/** \brief read [size] byte from [offset] to [buffer]
 *
 * \param offset uint32_t unit : byte
 * \param buffer uint8_t*
 * \param size uint32_t   unit : byte
 * \return uint32_t byte for read
 *
 */
static uint32_t w25x80_read(uint32_t offset, uint8_t * buffer, uint32_t size)
{
    uint8_t send_buffer[4];

    send_buffer[0] = CMD_WRDI;
    rt_spi_send(spi_flash_device.rt_spi_device, send_buffer, 1);

    send_buffer[0] = CMD_READ;
    send_buffer[1] = (uint8_t)(offset>>16);
    send_buffer[2] = (uint8_t)(offset>>8);
    send_buffer[3] = (uint8_t)(offset);

    rt_spi_send_then_recv(spi_flash_device.rt_spi_device,
                          send_buffer, 4,
                          buffer, size);

    return size;
}

/** \brief write N page on [page]
 *
 * \param page uint32_t unit : byte (4096 * N,1 page = 4096byte)
 * \param buffer const uint8_t*
 * \param size uint32_t unit : byte ( 4096*N )
 * \return uint32_t
 *
 */
static uint32_t w25x80_page_write(uint32_t page_addr, const uint8_t* buffer)
{
    uint32_t index;
    uint8_t send_buffer[4];

    RT_ASSERT((page_addr&0xFF) == 0); /* page addr must align to 256byte. */

    send_buffer[0] = CMD_WREN;
    rt_spi_send(spi_flash_device.rt_spi_device, send_buffer, 1);

    send_buffer[0] = CMD_PP;
    send_buffer[1] = (uint8_t)(page_addr >> 16);
    send_buffer[2] = (uint8_t)(page_addr >> 8);
    send_buffer[3] = (uint8_t)(page_addr);

    rt_spi_send_then_send(spi_flash_device.rt_spi_device,
                          send_buffer,
                          4,
                          buffer,
                          PAGE_SIZE);
    w25x80_wait_busy();

    return PAGE_SIZE;
}

/** \brief write 16 page on [1 sector]
 *
 * \param sector_addr uint32_t unit : byte (4096 * N,1 sector = 4096byte)
 * \param buffer const uint8_t*
 * \return uint32_t
 *
 */
static uint32_t w25x80_sector_write(uint32_t sector_addr, const uint8_t* buffer)
{
    uint32_t index;
    uint32_t page_addr = sector_addr;
    uint8_t send_buffer[4];

    RT_ASSERT((sector_addr&0xFF) == 0); /* sector addr must align to 256byte. */

    send_buffer[0] = CMD_WREN;
    rt_spi_send(spi_flash_device.rt_spi_device, send_buffer, 1);

    send_buffer[0] = CMD_ERASE_4K;
    send_buffer[1] = (sector_addr >> 16);
    send_buffer[2] = (sector_addr >> 8);
    send_buffer[3] = (sector_addr);
    rt_spi_send(spi_flash_device.rt_spi_device, send_buffer, 4);

    w25x80_wait_busy(); // wait erase done.

    // write 1 sector
    for (index=0; index < (SECTOR_SIZE / PAGE_SIZE); index++)
    {
        w25x80_page_write(page_addr, buffer);

        buffer += PAGE_SIZE;
        page_addr += PAGE_SIZE;
    }

    send_buffer[0] = CMD_WRDI;
    rt_spi_send(spi_flash_device.rt_spi_device, send_buffer, 1);

    return SECTOR_SIZE;
}

/* RT-Thread device interface */
static rt_err_t w25x80_flash_init(rt_device_t dev)
{
    return RT_EOK;
}

static rt_err_t w25x80_flash_open(rt_device_t dev, rt_uint16_t oflag)
{
    uint8_t send_buffer[3];

    flash_lock((struct spi_flash_device *)dev);

    send_buffer[0] = CMD_WREN;
    rt_spi_send(spi_flash_device.rt_spi_device, send_buffer, 1);

    send_buffer[0] = CMD_WRSR;
    send_buffer[1] = 0;
    send_buffer[2] = 0;
    rt_spi_send(spi_flash_device.rt_spi_device, send_buffer, 3);

    w25x80_wait_busy();

    flash_unlock((struct spi_flash_device *)dev);

    return RT_EOK;
}

static rt_err_t w25x80_flash_close(rt_device_t dev)
{
    return RT_EOK;
}

static rt_err_t w25x80_flash_control(rt_device_t dev, rt_uint8_t cmd, void *args)
{
    RT_ASSERT(dev != RT_NULL);

    if (cmd == RT_DEVICE_CTRL_BLK_GETGEOME)
    {
        struct rt_device_blk_geometry *geometry;

        geometry = (struct rt_device_blk_geometry *)args;
        if (geometry == RT_NULL) return -RT_ERROR;

        geometry->bytes_per_sector = spi_flash_device.geometry.bytes_per_sector;
        geometry->sector_count = spi_flash_device.geometry.sector_count;
        geometry->block_size = spi_flash_device.geometry.block_size;
    }

    return RT_EOK;
}

static rt_size_t w25x80_flash_read(rt_device_t dev,
                                   rt_off_t pos,
                                   void* buffer,
                                   rt_size_t size)
{
    flash_lock((struct spi_flash_device *)dev);

    w25x80_read(pos*spi_flash_device.geometry.bytes_per_sector,
                buffer,
                size*spi_flash_device.geometry.bytes_per_sector);

    flash_unlock((struct spi_flash_device *)dev);

    return size;
}

